MorgothCreator/mSdk/SDK/platform/stm32f7xx/interface/i2s_interface.c
  if(ret == AUDIO_OK)
  {
    /* Initialize the audio codec internal registers */
    if (_param->device->Init(_param->device->param,
                        OutputDevice,
                        Volume,
                        AudioFreq) != AUDIO_OK)
    {
      ret = AUDIO_ERROR;
    }
  }

  return ret;
}

/**
  * @brief  Starts playing audio stream from a data buffer for a determined size.
  * @param  pBuffer: Pointer to the buffer
  * @param  Size: Number of audio data BYTES.
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
unsigned char BSP_AUDIO_OUT_Play(void *param, unsigned short* pBuffer, unsigned long Size)
{
	I2S_t *_param = (I2S_t *)param;
  unsigned char ret = AUDIO_OK;

  /* Call the audio Codec Play function */
  if(_param->device->Play(_param->device->param, pBuffer, Size) != 0)
  {
    ret = AUDIO_ERROR;
  }

  /* Initiate a DMA transfer of PCM samples towards the serial audio interface */
  if(ret == AUDIO_OK)
  {
    if (HAL_SAI_Transmit_DMA(&haudio_out_sai, (unsigned char*) pBuffer, DMA_MAX(Size / AUDIODATA_SIZE))!= HAL_OK)
    {
      ret = AUDIO_ERROR;
    }
  }

  return ret;
}

/**
  * @brief  Sends n-Bytes on the SAI interface.
  * @param  pData: pointer on PCM samples buffer
  * @param  Size: number of data to be written
  */
void BSP_AUDIO_OUT_ChangeBuffer(void *param, unsigned short *pData, unsigned short Size)
{
   HAL_SAI_Transmit_DMA(&haudio_out_sai, (unsigned char*) pData, Size);
}

/**
  * @brief   This function Pauses the audio file stream. In case
  *          of using DMA, the DMA Pause feature is used.
  * @warning When calling BSP_AUDIO_OUT_Pause() function for pause, only
  *          BSP_AUDIO_OUT_Resume() function should be called for resume (use of BSP_AUDIO_OUT_Play()
  *          function for resume could lead to unexpected behavior).
  * @retval  AUDIO_OK if correct communication, else wrong communication
  */
unsigned char BSP_AUDIO_OUT_Pause(void *param)
{
	I2S_t *_param = (I2S_t *)param;
  unsigned char ret = AUDIO_OK;

  /* Call the Audio Codec Pause/Resume function */
  if(_param->device->Pause(_param->device->param) != 0)
  {
    ret =  AUDIO_ERROR;
  }

  /* Pause DMA transfer of PCM samples towards the serial audio interface */
  if(ret == AUDIO_OK)
  {
    if (HAL_SAI_DMAPause(&haudio_out_sai)!= HAL_OK)
    {
      ret =  AUDIO_ERROR;
    }
  }

  /* Return AUDIO_OK when all operations are correctly done */
  return ret;
}

/**
  * @brief  This function  Resumes the audio file stream.
  * @WARNING When calling BSP_AUDIO_OUT_Pause() function for pause, only
  *          BSP_AUDIO_OUT_Resume() function should be called for resume
  *          (use of BSP_AUDIO_OUT_Play() function for resume could lead to
  *           unexpected behavior).
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
unsigned char BSP_AUDIO_OUT_Resume(void *param)
{
	I2S_t *_param = (I2S_t *)param;
  unsigned char ret = AUDIO_OK;

  /* Call the Audio Codec Pause/Resume function */
  if(_param->device->Resume(_param->device->param) != 0)
  {
    ret =  AUDIO_ERROR;
  }

  /* Resume DMA transfer of PCM samples towards the serial audio interface */
  if(ret == AUDIO_OK)
  {
    if (HAL_SAI_DMAResume(&haudio_out_sai)!= HAL_OK)
    {
      ret =  AUDIO_ERROR;
    }
  }

  /* Return AUDIO_OK when all operations are correctly done */
  return ret;
}

/**
  * @brief  Stops audio playing and Power down the Audio Codec.
  * @param  Option: could be one of the following parameters
  *           - CODEC_PDWN_SW: for software power off (by writing registers).
  *                            Then no need to reconfigure the Codec after power on.
  *           - CODEC_PDWN_HW: completely shut down the codec (physically).
  *                            Then need to reconfigure the Codec after power on.
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
unsigned char BSP_AUDIO_OUT_Stop(void *param, unsigned long Option)
{
	I2S_t *_param = (I2S_t *)param;
  unsigned char ret = AUDIO_OK;

 /* Call Audio Codec Stop function */
  if(_param->device->Stop(_param->device->param, Option) != 0)
  {
    ret = AUDIO_ERROR;
  }

  if(ret == AUDIO_OK)
  {
    if(Option == CODEC_PDWN_HW)
    {
      /* Wait at least 100us */
      HAL_Delay(2);
    }

    /* Stop DMA transfer of PCM samples towards the serial audio interface */
    if (HAL_SAI_DMAStop(&haudio_out_sai)!= HAL_OK)
    {
      ret = AUDIO_ERROR;
    }
  }
  /* Return AUDIO_OK when all operations are correctly done */
  return ret;
}

/**
  * @brief  Controls the current audio volume level.
  * @param  Volume: Volume level to be set in percentage from 0% to 100% (0 for
  *         Mute and 100 for Max volume level).
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
unsigned char BSP_AUDIO_OUT_SetVolume(void *param, unsigned char Volume)
{
	I2S_t *_param = (I2S_t *)param;
  unsigned char ret = AUDIO_OK;

  /* Call the codec volume control function with converted volume value */
  if(_param->device->SetVolume(_param->device->param, Volume) != 0)
  {
    ret =  AUDIO_ERROR;
  }

  /* Return AUDIO_OK when all operations are correctly done */
  return ret;
}

/**
  * @brief  Enables or disables the MUTE mode by software
  * @param  Cmd: Could be AUDIO_MUTE_ON to mute sound or AUDIO_MUTE_OFF to
  *         unmute the codec and restore previous volume level.
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
unsigned char BSP_AUDIO_OUT_SetMute(void *param, unsigned long Cmd)
{
	I2S_t *_param = (I2S_t *)param;
  unsigned char ret = AUDIO_OK;

  /* Call the Codec Mute function */
  if(_param->device->SetMute(_param->device->param, Cmd) != 0)
  {
    ret = AUDIO_ERROR;
  }

  /* Return AUDIO_OK when all operations are correctly done */
  return ret;
}

/**
  * @brief  Switch dynamically (while audio file is being played) the output
  *          target (speaker or headphone).
  * @param  Output: The audio output target: OUTPUT_DEVICE_SPEAKER,
  *         OUTPUT_DEVICE_HEADPHONE or OUTPUT_DEVICE_BOTH
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
unsigned char BSP_AUDIO_OUT_SetOutputMode(void *param, unsigned char Output)
{
	I2S_t *_param = (I2S_t *)param;
  unsigned char ret = AUDIO_OK;

